Coding/Java/Java_Swing.org
#+OPTIONS: ^:{} _:{} num:t toc:t \n:t
#+include "../../template.org"

* JOptionPanel
  可以方便地显示对话框。
  showInputDialog/ showMessageDialog
* JButton
** JToggleButton
   按下后不起来，再按才会起来
** JCheckBox
   复选框
** JRadioButton
   单选按钮
** BasicArrowButton
   带箭头的按钮，方向由BasicArrowButton.NORTH SOUTH EAST WEST指定
** setPressedIcon(Icon pressIcon)
   当按钮按下时显示的图片

** setDisabledIcon(Icon disableIcon)
   当JButton不可用时显示的图片

** setToolTipText(String text)
   显示提示信息
   
* JTextField
** addActionListener(ActionEvent t)
   文本域的事件监听器，当在文本区域内输入回车时响应。
** setDocument(Document doc)
   关联当前文本区一document

* Document
  在javax.swing.text中
  The Document is a container for text that serves as the model for swing text components. The goal for this interface is to scale from very simple needs (a plain text textfield) to complex needs (an HTML or XML document, for example).
  document充当swing文本组件的包含文本的容器，
** addDocumentListener(DocumentListener listener)
   添加事件监听器

*** changeUpdate(DocumentEvent e)
    Gives notification that an attribute or set of attributes changed.
*** insertUpdate(DocumentEvent e)
    Gives notification that there was an insert into the document.
*** removeUpdate(DocumentEvent e)
    Gives notification that a portion of the document has been removed.

** insertString(int offset, String str, AttributeSet a)
   插入字符串，当DocumentEvent的insertUpdate(ActionEvent e)事件发生的时候会调用此函数。

* JList
  与ComboBox不同的是JList把所有的可选项都可见，而ComboBox把所有Item隐藏等待用户下拉后才看见。
  原型是JList<E>，是个容器，
* 构造函数 
#+BEGIN_SRC java
JList()
Constructs a JList with an empty, read-only, model.
JList(E[] listData)
Constructs a JList that displays the elements in the specified array.
JList(ListModel<E> dataModel)
Constructs a JList that displays elements from the specified, non-null, model.
JList(Vector<? extends E> listData)
Constructs a JList that displays the elements in the specified Vector.
#+END_SRC  
* ListMode
  This interface defines the methods components like JList use to get the value of each cell in a list and the length of the list. Logically the model is a vector, indices vary from 0 to ListDataModel.getSize() - 1. 
** DefaultListMode
*** addElement(E element)
    添加元素
*** add(int index, E element)
    在指定位置插入指定元素。
* JList 几个函数
** getSelectedValues()
   获取所选元素的值
** getSelectedIndices()
   获取所选元素的索引
* addListSelectionListener(ListSelectionListener)
** ListSelectionListener
   有Item选中时发生事件
** valueChanged(ListSelectionEvent e)
