codinglife/java/Java_Swing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Java<sub>Swing</sub></title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Java<sub>Swing</sub>"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-08-04 23:49:40 CST"/>
<meta name="author" content="visaya fan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div>

<div id="preamble">
<a href="#" id="tabzilla" class="tabzilla-opened" role="button" aria-expanded="true" aria-controls="tabzilla-panel" title="Close (Esc)">No_Joking</a>
</div>

<div id="content">
<h1 class="title">Java<sub>Swing</sub></h1>


<link rel="stylesheet" type="text/css" href="../../css/bootstrap.mozilla.css" />
<link rel="stylesheet" type="text/css" href="../../css/tabzilla.css" />
<link rel="stylesheet" type="text/css" href="../../css/vf.css" />
<script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script>
<script src="../../bootstrap/js/bootstrap.js"></script>
<script src="../../js/tabzilla.js"></script>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 JOptionPanel</a></li>
<li><a href="#sec-2">2 JButton</a>
<ul>
<li><a href="#sec-2-1">2.1 JToggleButton</a></li>
<li><a href="#sec-2-2">2.2 JCheckBox</a></li>
<li><a href="#sec-2-3">2.3 JRadioButton</a></li>
<li><a href="#sec-2-4">2.4 BasicArrowButton</a></li>
<li><a href="#sec-2-5">2.5 setPressedIcon(Icon pressIcon)</a></li>
<li><a href="#sec-2-6">2.6 setDisabledIcon(Icon disableIcon)</a></li>
<li><a href="#sec-2-7">2.7 setToolTipText(String text)</a></li>
</ul>
</li>
<li><a href="#sec-3">3 JTextField</a>
<ul>
<li><a href="#sec-3-1">3.1 addActionListener(ActionEvent t)</a></li>
<li><a href="#sec-3-2">3.2 setDocument(Document doc)</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Document</a>
<ul>
<li><a href="#sec-4-1">4.1 addDocumentListener(DocumentListener listener)</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1 changeUpdate(DocumentEvent e)</a></li>
<li><a href="#sec-4-1-2">4.1.2 insertUpdate(DocumentEvent e)</a></li>
<li><a href="#sec-4-1-3">4.1.3 removeUpdate(DocumentEvent e)</a></li>
</ul>
</li>
<li><a href="#sec-4-2">4.2 insertString(int offset, String str, AttributeSet a)</a></li>
</ul>
</li>
<li><a href="#sec-5">5 JList</a></li>
<li><a href="#sec-6">6 构造函数</a></li>
<li><a href="#sec-7">7 ListMode</a>
<ul>
<li><a href="#sec-7-1">7.1 DefaultListMode</a>
<ul>
<li><a href="#sec-7-1-1">7.1.1 addElement(E element)</a></li>
<li><a href="#sec-7-1-2">7.1.2 add(int index, E element)</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-8">8 JList 几个函数</a>
<ul>
<li><a href="#sec-8-1">8.1 getSelectedValues()</a></li>
<li><a href="#sec-8-2">8.2 getSelectedIndices()</a></li>
</ul>
</li>
<li><a href="#sec-9">9 addListSelectionListener(ListSelectionListener)</a>
<ul>
<li><a href="#sec-9-1">9.1 ListSelectionListener</a></li>
<li><a href="#sec-9-2">9.2 valueChanged(ListSelectionEvent e)</a></li>
</ul>
</li>
<li><a href="#sec-10">10 程序示例</a></li>
<li><a href="#sec-11">11 例子代码与结果</a></li>
<li><a href="#sec-12">12 javax.swing.border</a></li>
<li><a href="#sec-13">13 BorderFactory</a></li>
<li><a href="#sec-14">14 LineBorder</a></li>
<li><a href="#sec-15">15 MatteBorder</a></li>
<li><a href="#sec-16">16 TitleBorder</a></li>
<li><a href="#sec-17">17 BevelBorder</a></li>
<li><a href="#sec-18">18 SoftBevelBorder</a></li>
<li><a href="#sec-19">19 EtchedBorder</a></li>
<li><a href="#sec-20">20 CompoundBorder</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> JOptionPanel</h2>
<div class="outline-text-2" id="text-1">

<p>  可以方便地显示对话框。<br/>
  showInputDialog/ showMessageDialog<br/>
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> JButton</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> JToggleButton</h3>
<div class="outline-text-3" id="text-2-1">

<p>   按下后不起来，再按才会起来<br/>
</p></div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> JCheckBox</h3>
<div class="outline-text-3" id="text-2-2">

<p>   复选框<br/>
</p></div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> JRadioButton</h3>
<div class="outline-text-3" id="text-2-3">

<p>   单选按钮<br/>
</p></div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> BasicArrowButton</h3>
<div class="outline-text-3" id="text-2-4">

<p>   带箭头的按钮，方向由BasicArrowButton.NORTH SOUTH EAST WEST指定<br/>
</p></div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> setPressedIcon(Icon pressIcon)</h3>
<div class="outline-text-3" id="text-2-5">

<p>   当按钮按下时显示的图片<br/>
</p>
<p><br/>
</p></div>

</div>

<div id="outline-container-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> setDisabledIcon(Icon disableIcon)</h3>
<div class="outline-text-3" id="text-2-6">

<p>   当JButton不可用时显示的图片<br/>
</p>
<p><br/>
</p></div>

</div>

<div id="outline-container-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> setToolTipText(String text)</h3>
<div class="outline-text-3" id="text-2-7">

<p>   显示提示信息<br/>
</p>
<p>   <br/>
</p></div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> JTextField</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> addActionListener(ActionEvent t)</h3>
<div class="outline-text-3" id="text-3-1">

<p>   文本域的事件监听器，当在文本区域内输入回车时响应。<br/>
</p></div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> setDocument(Document doc)</h3>
<div class="outline-text-3" id="text-3-2">

<p>   关联当前文本区一document<br/>
</p>
<p><br/>
</p></div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Document</h2>
<div class="outline-text-2" id="text-4">

<p>  在javax.swing.text中<br/>
  The Document is a container for text that serves as the model for swing text components. The goal for this interface is to scale from very simple needs (a plain text textfield) to complex needs (an HTML or XML document, for example).<br/>
  document充当swing文本组件的包含文本的容器，<br/>
</p>
</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> addDocumentListener(DocumentListener listener)</h3>
<div class="outline-text-3" id="text-4-1">

<p>   添加事件监听器<br/>
</p>
<p><br/>
</p>
</div>

<div id="outline-container-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> changeUpdate(DocumentEvent e)</h4>
<div class="outline-text-4" id="text-4-1-1">

<p>    Gives notification that an attribute or set of attributes changed.<br/>
</p></div>

</div>

<div id="outline-container-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> insertUpdate(DocumentEvent e)</h4>
<div class="outline-text-4" id="text-4-1-2">

<p>    Gives notification that there was an insert into the document.<br/>
</p></div>

</div>

<div id="outline-container-4-1-3" class="outline-4">
<h4 id="sec-4-1-3"><span class="section-number-4">4.1.3</span> removeUpdate(DocumentEvent e)</h4>
<div class="outline-text-4" id="text-4-1-3">

<p>    Gives notification that a portion of the document has been removed.<br/>
</p>
<p><br/>
</p></div>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> insertString(int offset, String str, AttributeSet a)</h3>
<div class="outline-text-3" id="text-4-2">

<p>   插入字符串，当DocumentEvent的insertUpdate(ActionEvent e)事件发生的时候会调用此函数。<br/>
</p>
<p><br/>
</p></div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> JList</h2>
<div class="outline-text-2" id="text-5">

<p>  与ComboBox不同的是JList把所有的可选项都可见，而ComboBox把所有Item隐藏等待用户下拉后才看见。<br/>
  原型是JList&lt;E&gt;，是个容器，<br/>
</p></div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 构造函数</h2>
<div class="outline-text-2" id="text-6">


<p><br/>
<pre class="src src-java">JList()
Constructs a JList with an empty, read-only, <span style="color: #008b8b;">model</span>.
JList(<span style="color: #228b22;">E</span>[] <span style="color: #a0522d;">listData</span>)
Constructs a JList that displays the elements in the specified <span style="color: #008b8b;">array</span>.
JList(ListModel&lt;E&gt; dataModel)
Constructs a JList that displays elements from the specified, non-<span style="color: #008b8b;">null</span>, <span style="color: #008b8b;">model</span>.
JList(Vector&lt;? <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">E</span>&gt; listData)
Constructs a JList that displays the elements in the specified Vector.
</pre>

</p></div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> ListMode</h2>
<div class="outline-text-2" id="text-7">

<p>  This interface defines the methods components like JList use to get the value of each cell in a list and the length of the list. Logically the model is a vector, indices vary from 0 to ListDataModel.getSize() - 1. <br/>
</p>
</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> DefaultListMode</h3>
<div class="outline-text-3" id="text-7-1">


</div>

<div id="outline-container-7-1-1" class="outline-4">
<h4 id="sec-7-1-1"><span class="section-number-4">7.1.1</span> addElement(E element)</h4>
<div class="outline-text-4" id="text-7-1-1">

<p>    添加元素<br/>
</p></div>

</div>

<div id="outline-container-7-1-2" class="outline-4">
<h4 id="sec-7-1-2"><span class="section-number-4">7.1.2</span> add(int index, E element)</h4>
<div class="outline-text-4" id="text-7-1-2">

<p>    在指定位置插入指定元素。<br/>
</p></div>
</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> JList 几个函数</h2>
<div class="outline-text-2" id="text-8">


</div>

<div id="outline-container-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> getSelectedValues()</h3>
<div class="outline-text-3" id="text-8-1">

<p>   获取所选元素的值<br/>
</p></div>

</div>

<div id="outline-container-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> getSelectedIndices()</h3>
<div class="outline-text-3" id="text-8-2">

<p>   获取所选元素的索引<br/>
</p></div>
</div>

</div>
