Coding/Java/Java_Swing.org
* 程序示例
#+BEGIN_SRC java
package xjtu.vf.swing;
import java.awt.Color;
import java.awt.FlowLayout;
import java.awt.event.ActionEvent;
import java.awt.event.ActionListener;
import javax.swing.BorderFactory;
import javax.swing.DefaultListModel;
import javax.swing.JButton;
import javax.swing.JFrame;
import javax.swing.JList;
import javax.swing.JTextArea;
import javax.swing.border.Border;
import javax.swing.event.ListSelectionEvent;
import javax.swing.event.ListSelectionListener;
public class List extends JFrame {
	private String[] flavors = { "A", "B", "C", "D", "E", "F" };
	private DefaultListModel lItems = new DefaultListModel();
	private JList lst = new JList(lItems);
	private JTextArea t = new JTextArea(flavors.length, 20);
	private JButton b = new JButton("Add Item");
	private ActionListener bl = new ActionListener() {
		public void actionPerformed(ActionEvent e) {
			if (count < flavors.length)
				lItems.add(0, flavors[count++]);
			else
				b.setEnabled(false);
		}
	};
	private ListSelectionListener lsl = new ListSelectionListener() {
		@SuppressWarnings("deprecation")
		public void valueChanged(ListSelectionEvent e) {
			if (e.getValueIsAdjusting())
				return;
			t.setText("");
			for (Object item : lst.getSelectedValues())
				t.append(item + "\n");
		}
	};
	private int count = 0;
	public List() {
		t.setEditable(true);
		setLayout(new FlowLayout());
		Border brd = BorderFactory.createMatteBorder(1, 1, 2, 2, Color.black);
		lst.setBorder(brd);
		t.setBorder(brd);
		for (int i = 0; i < 4; i++)
			lItems.addElement(flavors[count++]);
		add(t);
		add(lst);
		add(b);
		b.addActionListener(bl);
		lst.addListSelectionListener(lsl);
	}
	public static void main(String[] args) {
		SwingConsole.run(new List(), 250, 375);
	}
}
#+END_SRC  
   
* 例子代码与结果
#+BEGIN_SRC java
package xjtu.vf.swing;

import java.awt.BorderLayout;
import java.awt.Color;
import java.awt.GridLayout;

import javax.swing.*;
import javax.swing.border.*;

public class Borders extends JFrame {
	static JPanel showBorder(Border b) {
		JPanel jp = new JPanel();
		jp.setLayout(new BorderLayout());
		String mm = b.getClass().toString();
		mm = mm.substring(mm.lastIndexOf('.') + 1);
		jp.add(new JLabel(mm, JLabel.CENTER), BorderLayout.CENTER);
		jp.setBorder(b);
		return jp;
	}

	public Borders() {
		setLayout(new GridLayout(2, 4));
		add(showBorder(new TitledBorder("Title")));
		add(showBorder(new EtchedBorder()));
		add(showBorder(new LineBorder(Color.blue)));
		add(showBorder(new MatteBorder(5, 5, 30, 30, Color.GREEN)));
		add(showBorder(new BevelBorder(BevelBorder.RAISED)));
		add(showBorder(new SoftBevelBorder(BevelBorder.LOWERED)));
		add(showBorder(new CompoundBorder(new EtchedBorder(), new LineBorder(
				Color.RED))));
	}

	public static void main(String[] args) {
		SwingConsole.run(new Borders(), 500, 300);
	}
}
#+END_SRC  
* javax.swing.border
  AbstractBorder所有边框类的父类

