codinglife/java/Java_Swing.html

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> addListSelectionListener(ListSelectionListener)</h2>
<div class="outline-text-2" id="text-9">


</div>

<div id="outline-container-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> ListSelectionListener</h3>
<div class="outline-text-3" id="text-9-1">

<p>   有Item选中时发生事件<br/>
</p></div>

</div>

<div id="outline-container-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> valueChanged(ListSelectionEvent e)</h3>
<div class="outline-text-3" id="text-9-2">

</div>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> 程序示例</h2>
<div class="outline-text-2" id="text-10">


<p><br/>
<pre class="src src-java"><span style="color: #a020f0;">package</span> xjtu.vf.<span style="color: #008b8b;">swing</span>;
<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">awt</span>.<span style="color: #228b22;">Color</span>;
<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">awt</span>.<span style="color: #228b22;">FlowLayout</span>;
<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">awt</span>.<span style="color: #008b8b;">event</span>.<span style="color: #228b22;">ActionEvent</span>;
<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">awt</span>.<span style="color: #008b8b;">event</span>.<span style="color: #228b22;">ActionListener</span>;
<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">javax</span>.<span style="color: #008b8b;">swing</span>.<span style="color: #228b22;">BorderFactory</span>;
<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">javax</span>.<span style="color: #008b8b;">swing</span>.<span style="color: #228b22;">DefaultListModel</span>;
<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">javax</span>.<span style="color: #008b8b;">swing</span>.<span style="color: #228b22;">JButton</span>;
<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">javax</span>.<span style="color: #008b8b;">swing</span>.<span style="color: #228b22;">JFrame</span>;
<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">javax</span>.<span style="color: #008b8b;">swing</span>.<span style="color: #228b22;">JList</span>;
<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">javax</span>.<span style="color: #008b8b;">swing</span>.<span style="color: #228b22;">JTextArea</span>;
<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">javax</span>.<span style="color: #008b8b;">swing</span>.<span style="color: #008b8b;">border</span>.<span style="color: #228b22;">Border</span>;
<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">javax</span>.<span style="color: #008b8b;">swing</span>.<span style="color: #008b8b;">event</span>.<span style="color: #228b22;">ListSelectionEvent</span>;
<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">javax</span>.<span style="color: #008b8b;">swing</span>.<span style="color: #008b8b;">event</span>.<span style="color: #228b22;">ListSelectionListener</span>;
<span style="color: #a020f0;">public</span> <span style="color: #a020f0;">class</span> <span style="color: #228b22;">List</span> <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">JFrame</span> {
    <span style="color: #a020f0;">private</span> <span style="color: #228b22;">String</span>[] <span style="color: #a0522d;">flavors</span> = { <span style="color: #8b2252;">"A"</span>, <span style="color: #8b2252;">"B"</span>, <span style="color: #8b2252;">"C"</span>, <span style="color: #8b2252;">"D"</span>, <span style="color: #8b2252;">"E"</span>, <span style="color: #8b2252;">"F"</span> };
    <span style="color: #a020f0;">private</span> <span style="color: #228b22;">DefaultListModel</span> <span style="color: #a0522d;">lItems</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">DefaultListModel</span>();
    <span style="color: #a020f0;">private</span> <span style="color: #228b22;">JList</span> <span style="color: #a0522d;">lst</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">JList</span>(lItems);
    <span style="color: #a020f0;">private</span> <span style="color: #228b22;">JTextArea</span> <span style="color: #a0522d;">t</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">JTextArea</span>(flavors.length, 20);
    <span style="color: #a020f0;">private</span> <span style="color: #228b22;">JButton</span> <span style="color: #a0522d;">b</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">JButton</span>(<span style="color: #8b2252;">"Add Item"</span>);
    <span style="color: #a020f0;">private</span> <span style="color: #228b22;">ActionListener</span> <span style="color: #a0522d;">bl</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">ActionListener</span>() {
        <span style="color: #a020f0;">public</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">actionPerformed</span>(<span style="color: #228b22;">ActionEvent</span> <span style="color: #a0522d;">e</span>) {
            <span style="color: #a020f0;">if</span> (count &lt; flavors.length)
                lItems.add(0, flavors[count++]);
            <span style="color: #a020f0;">else</span>
                b.setEnabled(<span style="color: #008b8b;">false</span>);
        }
    };
    <span style="color: #a020f0;">private</span> <span style="color: #228b22;">ListSelectionListener</span> <span style="color: #a0522d;">lsl</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">ListSelectionListener</span>() {
        @SuppressWarnings(<span style="color: #8b2252;">"deprecation"</span>)
        <span style="color: #a020f0;">public</span> <span style="color: #228b22;">void</span> valueChanged(<span style="color: #228b22;">ListSelectionEvent</span> <span style="color: #a0522d;">e</span>) {
            <span style="color: #a020f0;">if</span> (e.getValueIsAdjusting())
                <span style="color: #a020f0;">return</span>;
            t.setText(<span style="color: #8b2252;">""</span>);
            <span style="color: #a020f0;">for</span> (Object item : lst.getSelectedValues())
                t.append(item + <span style="color: #8b2252;">"\n"</span>);
        }
    };
    <span style="color: #a020f0;">private</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">count</span> = 0;
    <span style="color: #a020f0;">public</span> List() {
        t.setEditable(<span style="color: #008b8b;">true</span>);
        setLayout(<span style="color: #a020f0;">new</span> <span style="color: #228b22;">FlowLayout</span>());
        <span style="color: #228b22;">Border</span> <span style="color: #a0522d;">brd</span> = BorderFactory.createMatteBorder(1, 1, 2, 2, Color.black);
        lst.setBorder(brd);
        t.setBorder(brd);
        <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span> = 0; i &lt; 4; i++)
            lItems.addElement(flavors[count++]);
        add(t);
        add(lst);
        add(b);
        b.addActionListener(bl);
        lst.addListSelectionListener(lsl);
    }
    <span style="color: #a020f0;">public</span> <span style="color: #a020f0;">static</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">String</span>[] <span style="color: #a0522d;">args</span>) {
        SwingConsole.run(<span style="color: #a020f0;">new</span> <span style="color: #228b22;">List</span>(), 250, 375);
    }
}
</pre>

</p>
<p>   <br/>
</p></div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> 例子代码与结果</h2>
<div class="outline-text-2" id="text-11">


<p><br/>
<pre class="src src-java"><span style="color: #a020f0;">package</span> xjtu.vf.<span style="color: #008b8b;">swing</span>;

<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">awt</span>.<span style="color: #228b22;">BorderLayout</span>;
<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">awt</span>.<span style="color: #228b22;">Color</span>;
<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">java</span>.<span style="color: #008b8b;">awt</span>.<span style="color: #228b22;">GridLayout</span>;

<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">javax</span>.<span style="color: #008b8b;">swing</span>.*;
<span style="color: #a020f0;">import</span> <span style="color: #008b8b;">javax</span>.<span style="color: #008b8b;">swing</span>.<span style="color: #008b8b;">border</span>.*;

<span style="color: #a020f0;">public</span> <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Borders</span> <span style="color: #a020f0;">extends</span> <span style="color: #228b22;">JFrame</span> {
    <span style="color: #a020f0;">static</span> <span style="color: #228b22;">JPanel</span> <span style="color: #0000ff;">showBorder</span>(<span style="color: #228b22;">Border</span> <span style="color: #a0522d;">b</span>) {
        <span style="color: #228b22;">JPanel</span> <span style="color: #a0522d;">jp</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">JPanel</span>();
        jp.setLayout(<span style="color: #a020f0;">new</span> <span style="color: #228b22;">BorderLayout</span>());
        <span style="color: #228b22;">String</span> <span style="color: #a0522d;">mm</span> = b.getClass().toString();
        mm = mm.substring(mm.lastIndexOf(<span style="color: #8b2252;">'.'</span>) + 1);
        jp.add(<span style="color: #a020f0;">new</span> <span style="color: #228b22;">JLabel</span>(mm, <span style="color: #008b8b;">JLabel</span>.CENTER), <span style="color: #008b8b;">BorderLayout</span>.CENTER);
        jp.setBorder(b);
        <span style="color: #a020f0;">return</span> jp;
    }

    <span style="color: #a020f0;">public</span> Borders() {
        setLayout(<span style="color: #a020f0;">new</span> <span style="color: #228b22;">GridLayout</span>(2, 4));
        add(showBorder(<span style="color: #a020f0;">new</span> <span style="color: #228b22;">TitledBorder</span>(<span style="color: #8b2252;">"Title"</span>)));
        add(showBorder(<span style="color: #a020f0;">new</span> <span style="color: #228b22;">EtchedBorder</span>()));
        add(showBorder(<span style="color: #a020f0;">new</span> <span style="color: #228b22;">LineBorder</span>(Color.blue)));
        add(showBorder(<span style="color: #a020f0;">new</span> <span style="color: #228b22;">MatteBorder</span>(5, 5, 30, 30, <span style="color: #008b8b;">Color</span>.GREEN)));
        add(showBorder(<span style="color: #a020f0;">new</span> <span style="color: #228b22;">BevelBorder</span>(<span style="color: #008b8b;">BevelBorder</span>.RAISED)));
        add(showBorder(<span style="color: #a020f0;">new</span> <span style="color: #228b22;">SoftBevelBorder</span>(<span style="color: #008b8b;">BevelBorder</span>.LOWERED)));
        add(showBorder(<span style="color: #a020f0;">new</span> <span style="color: #228b22;">CompoundBorder</span>(<span style="color: #a020f0;">new</span> <span style="color: #228b22;">EtchedBorder</span>(), <span style="color: #a020f0;">new</span> <span style="color: #228b22;">LineBorder</span>(
                <span style="color: #008b8b;">Color</span>.RED))));
    }

    <span style="color: #a020f0;">public</span> <span style="color: #a020f0;">static</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">String</span>[] <span style="color: #a0522d;">args</span>) {
        SwingConsole.run(<span style="color: #a020f0;">new</span> <span style="color: #228b22;">Borders</span>(), 500, 300);
    }
}
</pre>

</p></div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> javax.swing.border</h2>
<div class="outline-text-2" id="text-12">

<p>  AbstractBorder所有边框类的父类<br/>
</p>
<p><br/>
</p></div>

</div>
