codinglife/java/Java_Swing.html

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> BorderFactory</h2>
<div class="outline-text-2" id="text-13">

<p>  使用工厂设计模式快速设计边框，隐藏创建细节。<br/>
</p></div>

</div>

<div id="outline-container-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> LineBorder</h2>
<div class="outline-text-2" id="text-14">

<p>  LineBorder是围绕组件周围用户义定宽度的单色行边框。他可以具有方角或是圆角。<br/>
  <b>LineBorder有三个构造函数，两个工厂方法以及两个BorderFactory工厂方法</b><br/>
</p>
<p><br/>
<pre class="src src-java"><span style="color: #a020f0;">public</span> LineBorder(<span style="color: #228b22;">Color</span> <span style="color: #a0522d;">color</span>)
Border lineBorder = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">LineBorder</span> (<span style="color: #008b8b;">Color</span>.RED);

<span style="color: #a020f0;">public</span> LineBorder(<span style="color: #228b22;">Color</span> <span style="color: #a0522d;">color</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">thickness</span>)
Border lineBorder = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">LineBorder</span> (<span style="color: #008b8b;">Color</span>.RED, 5);

<span style="color: #a020f0;">public</span> LineBorder (<span style="color: #228b22;">Color</span> <span style="color: #a0522d;">color</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">thickness</span>, <span style="color: #228b22;">boolean</span> <span style="color: #a0522d;">roundedCorners</span>)
Border lineBorder = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">LineBorder</span> (<span style="color: #008b8b;">Color</span>.RED, 5, <span style="color: #008b8b;">true</span>);

<span style="color: #a020f0;">public</span> <span style="color: #a020f0;">static</span> <span style="color: #228b22;">Border</span> <span style="color: #0000ff;">createBlackLineBorder</span>()
Border blackLine = LineBorder.createBlackLineBorder();

<span style="color: #a020f0;">public</span> <span style="color: #a020f0;">static</span> <span style="color: #228b22;">Border</span> <span style="color: #0000ff;">createGrayLineBorder</span>()
Border grayLine = LineBorder.createGrayLineBorder();

<span style="color: #a020f0;">public</span> <span style="color: #a020f0;">static</span> <span style="color: #228b22;">Border</span> <span style="color: #0000ff;">createLineBorder</span>(<span style="color: #228b22;">Color</span> <span style="color: #a0522d;">color</span>)
Border lineBorder = BorderFactory.createLineBorder(<span style="color: #008b8b;">Color</span>.RED);

<span style="color: #a020f0;">public</span> <span style="color: #a020f0;">static</span> <span style="color: #228b22;">Border</span> <span style="color: #0000ff;">createLineBorder</span>(<span style="color: #228b22;">Color</span> <span style="color: #a0522d;">color</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">thickness</span>)
Border lineBorder = BorderFactory.createLineBorder(<span style="color: #008b8b;">Color</span>.RED, 5);
</pre>

</p></div>

</div>

<div id="outline-container-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> MatteBorder</h2>
<div class="outline-text-2" id="text-15">

<p>  如果我们希望修改不同边的粗细，我们需要使用MatteBorder，<br/>
</p>
<p><br/>
<pre class="src src-java">MatteBorder(<span style="color: #228b22;">Icon</span> <span style="color: #a0522d;">tileIcon</span>)      
Creates a matte border with the specified tile <span style="color: #008b8b;">icon</span>.
MatteBorder(<span style="color: #228b22;">Insets</span> <span style="color: #a0522d;">borderInsets</span>, <span style="color: #228b22;">Color</span> <span style="color: #a0522d;">matteColor</span>)
Creates a matte border with the specified insets and <span style="color: #008b8b;">color</span>.
MatteBorder(<span style="color: #228b22;">Insets</span> <span style="color: #a0522d;">borderInsets</span>, <span style="color: #228b22;">Icon</span> <span style="color: #a0522d;">tileIcon</span>)
Creates a matte border with the specified insets and tile <span style="color: #008b8b;">icon</span>.
MatteBorder(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">top</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">left</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">bottom</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">right</span>, <span style="color: #228b22;">Color</span> <span style="color: #a0522d;">matteColor</span>)
Creates a matte border with the specified insets and <span style="color: #008b8b;">color</span>.
MatteBorder(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">top</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">left</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">bottom</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">right</span>, <span style="color: #228b22;">Icon</span> <span style="color: #a0522d;">tileIcon</span>)
Creates a matte border with the specified insets and tile icon.
</pre>

</p></div>

</div>

<div id="outline-container-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> TitleBorder</h2>
<div class="outline-text-2" id="text-16">


<p><br/>
</p></div>

</div>

<div id="outline-container-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> BevelBorder</h2>
<div class="outline-text-2" id="text-17">

<p>  BevelBorder以三维外观绘制边框，其可以表现为升起或是降低。当边框升起时，在边框的底部与右边会出现阴影效果。当降低时，阴影的位置会相反。<br/>
  <b>BevelBorder有三个构造函数以及一个工厂方法，同时还有BorderFactory创建BevelBorder对象的五个工厂方法：</b><br/>
</p>
<p><br/>
<pre class="src src-java"><span style="color: #a020f0;">public</span> BevelBorder(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">bevelType</span>)
Border bevelBorder = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">BevelBorder</span>(<span style="color: #008b8b;">BevelBorder</span>.RAISED);

<span style="color: #a020f0;">public</span> BevelBorder(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">bevelType</span>, <span style="color: #228b22;">Color</span> <span style="color: #a0522d;">highlight</span>, <span style="color: #228b22;">Color</span> <span style="color: #a0522d;">shadow</span>)
Border bevelBorder = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">BevelBorder</span>(<span style="color: #008b8b;">BevelBorder</span>.RAISED, <span style="color: #008b8b;">Color</span>.PINK, <span style="color: #008b8b;">Color</span>.RED);

<span style="color: #a020f0;">public</span> BevelBorder(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">bevelType</span>, <span style="color: #228b22;">Color</span> <span style="color: #a0522d;">highlightOuter</span>, <span style="color: #228b22;">Color</span> <span style="color: #a0522d;">highlightInner</span>,
  <span style="color: #228b22;">Color</span> <span style="color: #a0522d;">shadowOuter</span>, <span style="color: #228b22;">Color</span> <span style="color: #a0522d;">shadowInner</span>)
Border bevelBorder = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">BevelBorder</span>(<span style="color: #008b8b;">BevelBorder</span>.RAISED, <span style="color: #008b8b;">Color</span>.PINK,
  <span style="color: #008b8b;">Color</span>.PINK.brighter(), <span style="color: #008b8b;">Color</span>.RED, <span style="color: #008b8b;">Color</span>.RED.darker());

<span style="color: #a020f0;">public</span> <span style="color: #a020f0;">static</span> <span style="color: #228b22;">Border</span> <span style="color: #0000ff;">createBevelBorder</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">bevelType</span>)
Border bevelBorder = BorderFactory.createBevelBorder(<span style="color: #008b8b;">BevelBorder</span>.RAISED);

<span style="color: #a020f0;">public</span> <span style="color: #a020f0;">static</span> <span style="color: #228b22;">Border</span> <span style="color: #0000ff;">createLoweredBevelBorder</span>()
Border bevelBorder = BorderFactory.createLoweredBevelBorder();

<span style="color: #a020f0;">public</span> <span style="color: #a020f0;">static</span> <span style="color: #228b22;">Border</span> <span style="color: #0000ff;">createRaisedBevelBorder</span>()
Border bevelBorder = BorderFactory.createRaisedBevelBorder();

<span style="color: #a020f0;">public</span> <span style="color: #a020f0;">static</span> <span style="color: #228b22;">Border</span> <span style="color: #0000ff;">createBevelBorder</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">bevelType</span>, <span style="color: #228b22;">Color</span> <span style="color: #a0522d;">highlight</span>, <span style="color: #228b22;">Color</span> <span style="color: #a0522d;">shadow</span>)
Border bevelBorder = BorderFactory.createBevelBorder(<span style="color: #008b8b;">BevelBorder</span>.RAISED,
  <span style="color: #008b8b;">Color</span>.PINK, <span style="color: #008b8b;">Color</span>.RED);

<span style="color: #a020f0;">public</span> <span style="color: #a020f0;">static</span> <span style="color: #228b22;">Border</span> <span style="color: #0000ff;">createBevelBorder</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">bevelType</span>, <span style="color: #228b22;">Color</span> <span style="color: #a0522d;">highlightOuter</span>,
  <span style="color: #228b22;">Color</span> <span style="color: #a0522d;">highlightInner</span>, <span style="color: #228b22;">Color</span> <span style="color: #a0522d;">shadowOuter</span>, <span style="color: #228b22;">Color</span> <span style="color: #a0522d;">shadowInner</span>)
Border bevelBorder = BorderFactory.createBevelBorder(<span style="color: #008b8b;">BevelBorder</span>.RAISED,
  <span style="color: #008b8b;">Color</span>.PINK, <span style="color: #008b8b;">Color</span>.PINK.brighter(), <span style="color: #008b8b;">Color</span>.RED, <span style="color: #008b8b;">Color</span>.RED.darker());
</pre>


</p></div>

</div>

<div id="outline-container-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> SoftBevelBorder</h2>
<div class="outline-text-2" id="text-18">

<p>  oftBevelBorder是BevelBorder的近亲。这个组件会包围四角，所以他们的边并不尖利。<br/>
  而他使用下边与右边的相应外边颜色只绘制一条线。<br/>
  <b>SoftBevelBorder有三个构造函数：</b><br/>
</p>
<p><br/>
<pre class="src src-java"><span style="color: #a020f0;">public</span> SoftBevelBorder(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">bevelType</span>)
Border softBevelBorder = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">SoftBevelBorder</span>(<span style="color: #008b8b;">SoftBevelBorder</span>.RAISED);

<span style="color: #a020f0;">public</span> SoftBevelBorder(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">bevelType</span>, <span style="color: #228b22;">Color</span> <span style="color: #a0522d;">highlight</span>, <span style="color: #228b22;">Color</span> <span style="color: #a0522d;">shadow</span>)
Border softBevelBorder = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">SoftBevelBorder</span>(<span style="color: #008b8b;">SoftBevelBorder</span>.RAISED, <span style="color: #008b8b;">Color</span>.RED,
  <span style="color: #008b8b;">Color</span>.PINK);

SoftBevelBorder(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">bevelType</span>, <span style="color: #228b22;">Color</span> <span style="color: #a0522d;">highlightOuterColor</span>, <span style="color: #228b22;">Color</span> <span style="color: #a0522d;">highlightInnerColor</span>, <span style="color: #228b22;">Color</span> <span style="color: #a0522d;">shadowOuterColor</span>, <span style="color: #228b22;">Color</span> <span style="color: #a0522d;">shadowInnerColor</span>)
</pre>

</p></div>

</div>
